export const routineDefaults = {
  "school": {
    "branch": "স্কুল",
    "academicYear": "২০২৬",
    "effectiveDate": "২০২৬-০১-০১",
    "periods": [
      "সমাবেশ ১০-১০:২০",
      "১ম ঘন্টা ১০:২০-১১:০০",
      "২য় ঘন্টা  ১১:০০-১১:৪০",
      "৩য় ঘন্টা  ১১:৪০-১২:২০",
      "৪র্থ ঘন্টা  ১২:২০-১:০০",
      "৫ম ঘন্টা  ১:০০-১:৩০",
      "বিরতি ১:৩০-২:০০",
      "৬ষ্ঠ ঘন্টা ২:০০-২:৩০",
      "৭ম ঘন্টা ২:৩০-৩:০০"
    ],
    "days": [
      {
        "name": "রবিবার",
        "classes": [
          {
            "name": "৬ষ্ঠ",
            "lessons": [
              "",
              "ইংরেজি\nRA-F",
              "গণিত\nJH",
              "বা ও বি\nSA-F",
              "বিজ্ঞান\nDR",
              "বাংলা\nNA",
              "",
              "ধর্ম\nSA-F",
              "কৃষি\nSA"
            ]
          },
          {
            "name": "৭ম",
            "lessons": [
              "",
              "গণিত\nSI",
              "বাংলা\nNA",
              "কৃষি\nSA",
              "ইংরেজি\nKK",
              "বা ও বি\nNA-O",
              "",
              "বিজ্ঞান\nDR",
              "ধর্ম\nCA"
            ]
          },
          {
            "name": "৮ম",
            "lessons": [
              "",
              "বিজ্ঞান\nSA",
              "ইংরেজি\nRA",
              "গণিত\nSI",
              "কৃষি\nSA",
              "ধর্ম\nKK",
              "",
              "তথ্য\nJH",
              "বাংলা\nNF"
            ]
          },
          {
            "name": "৯ম",
            "lessons": [
              "",
              "পদার্থ-১\nEH",
              "বাংলা-১\nNF",
              "রসায়ন-১\nSS",
              "গণিত-১\nEH",
              "ট্রেড-১\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "বা ও বি-১\nRA",
              "ইংরেজি-১\nTA"
            ]
          },
          {
            "name": "১০ম",
            "lessons": [
              "",
              "গণিত-২\nSS",
              "পদার্থ-২\nEH",
              "বাংলা-২\nNF",
              "ইংরেজি-২\nTA",
              "ট্রেড-৩\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "ধর্ম-২\nSI",
              "বা ও বি-২\nRA"
            ]
          }
        ]
      },
      {
        "name": "সোমবার",
        "classes": [
          {
            "name": "৬ষ্ঠ",
            "lessons": [
              "",
              "ইংরেজি\nRA-F",
              "গণিত\nJH",
              "বা ও বি\nSA-F",
              "বিজ্ঞান\nDR",
              "বাংলা\nNA",
              "",
              "ধর্ম\nSA-F",
              "কৃষি\nSA"
            ]
          },
          {
            "name": "৭ম",
            "lessons": [
              "",
              "গণিত\nSI",
              "বাংলা\nNA",
              "কৃষি\nSA",
              "ইংরেজি\nKK",
              "বা ও বি\nNA-O",
              "",
              "বিজ্ঞান\nDR",
              "ধর্ম\nCA"
            ]
          },
          {
            "name": "৮ম",
            "lessons": [
              "",
              "বিজ্ঞান\nSA",
              "ইংরেজি\nRA",
              "গণিত\nSI",
              "কৃষি\nSA",
              "বাংলা\nNF",
              "",
              "তথ্য\nJH",
              "ধর্ম\nKK"
            ]
          },
          {
            "name": "৯ম",
            "lessons": [
              "",
              "পদার্থ-১\nEH",
              "ইংরেজি-১\nTA",
              "রসায়ন-১\nSS",
              "গণিত-১\nEH",
              "ধর্ম-১\nSI",
              "",
              "বা ও বি-১\nRA",
              "বাংলা-১\nNF"
            ]
          },
          {
            "name": "১০ম",
            "lessons": [
              "",
              "গণিত-২\nSS",
              "পদার্থ-২\nEH",
              "বাংলা-২\nNF",
              "ইংরেজি-২\nTA",
              "রসায়ন-২\nSS",
              "",
              "ধর্ম-২\nSI",
              "বা ও বি-২\nRA"
            ]
          }
        ]
      },
      {
        "name": "মঙ্গলবার",
        "classes": [
          {
            "name": "৬ষ্ঠ",
            "lessons": [
              "",
              "ইংরেজি\nRA-F",
              "গণিত\nJH",
              "তথ্য\nTA",
              "বিজ্ঞান\nDR",
              "বাংলা\nNA",
              "",
              "ধর্ম\nSA-F",
              "কৃষি\nSA"
            ]
          },
          {
            "name": "৭ম",
            "lessons": [
              "",
              "গণিত\nSI",
              "বাংলা\nNA",
              "বা ও বি\nNA-O",
              "ইংরেজি\nKK",
              "শা শি\nKK",
              "",
              "বিজ্ঞান\nDR",
              "তথ্য\nJH"
            ]
          },
          {
            "name": "৮ম",
            "lessons": [
              "",
              "বিজ্ঞান\nSA",
              "ইংরেজি\nRA",
              "গণিত\nSI",
              "কর্ম ও জীবন\nKK",
              "বা ও বি\nRA",
              "",
              "শা শি\nKK",
              "বাংলা\nNF"
            ]
          },
          {
            "name": "৯ম",
            "lessons": [
              "",
              "পদার্থ-১\nEH",
              "ইংরেজি-১\nTA",
              "রসায়ন-১\nSS",
              "গণিত-১\nEH",
              "বাংলা-১\nNF",
              "",
              "ট্রেড-২\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "ড্রইং"
            ]
          },
          {
            "name": "১০ম",
            "lessons": [
              "",
              "গণিত-২\nSS",
              "পদার্থ-২\nEH",
              "বাংলা-২\nNF",
              "ইংরেজি-২\nTA",
              "রসায়ন-২\nSS",
              "",
              "ট্রেড-৪\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "আত্নকর্ম\nKK"
            ]
          }
        ]
      },
      {
        "name": "বুধবার",
        "classes": [
          {
            "name": "৬ষ্ঠ",
            "lessons": [
              "",
              "ইংরেজি\nRA-F",
              "গণিত\nJH",
              "বা ও বি\nSA-F",
              "বিজ্ঞান\nDR",
              "বাংলা\nNA",
              "",
              "কর্ম ও জীবন\nRA-F",
              "ইংরেজি-২\nRA-F"
            ]
          },
          {
            "name": "৭ম",
            "lessons": [
              "",
              "গণিত\nSI",
              "বাংলা\nNA",
              "তথ্য\nJH",
              "ইংরেজি\nKK",
              "কর্ম ও জীবন\nRA-F",
              "",
              "ইংরেজি-২\nKK",
              "ধর্ম\nCA"
            ]
          },
          {
            "name": "৮ম",
            "lessons": [
              "",
              "বিজ্ঞান\nSA",
              "ইংরেজি\nRA",
              "গণিত\nSI",
              "বাংলা\nNF",
              "বা ও বি\nRA",
              "",
              "ইংরেজি-২\nRA",
              "ধর্ম\nKK"
            ]
          },
          {
            "name": "৯ম",
            "lessons": [
              "",
              "বাংলা-১\nNF",
              "ইংরেজি-১\nTA",
              "কৃষি-১\nSA",
              "গণিত-১\nEH",
              "ট্রেড-১\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "ধর্ম-১\nSI",
              "ট্রেড-২\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু."
            ]
          },
          {
            "name": "১০ম",
            "lessons": [
              "",
              "গণিত-২\nSS",
              "কৃষি-২\nSA",
              "বাংলা-২\nNF",
              "ইংরেজি-২\nTA",
              "ট্রেড-৩\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "রসায়ন-২\nSS",
              "ট্রেড-৪\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু."
            ]
          }
        ]
      },
      {
        "name": "বৃহষ্পতিবার",
        "classes": [
          {
            "name": "৬ষ্ঠ",
            "lessons": [
              "",
              "ইংরেজি\nRA-F",
              "গণিত\nJH",
              "বাংলা\nNA",
              "তথ্য\nTA",
              "বাংলা-২\nNA",
              "",
              "শা শি\nKK",
              "ইংরেজি-২\nRA-F"
            ]
          },
          {
            "name": "৭ম",
            "lessons": [
              "",
              "গণিত\nSI",
              "বাংলা\nNA",
              "বিজ্ঞান\nDR",
              "ইংরেজি\nKK",
              "ইংরেজি-২\nKK",
              "",
              "কৃষি\nSA",
              "বাংলা-২\nNA"
            ]
          },
          {
            "name": "৮ম",
            "lessons": [
              "",
              "বা ও বি\nRA",
              "ইংরেজি\nRA",
              "গণিত\nSI",
              "বাংলা\nNF",
              "কৃষি\nSA",
              "",
              "বাংলা-২\nNF",
              "ইংরেজি-২\nRA"
            ]
          },
          {
            "name": "৯ম",
            "lessons": [
              "",
              "বাংলা-১\nNF",
              "কৃষি\nSA",
              "ইংরেজি-১\nTA",
              "গণিত-১\nEH",
              "ট্রেড-১\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "ধর্ম-১\nSI",
              "ট্রেড-২\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু."
            ]
          },
          {
            "name": "১০ম",
            "lessons": [
              "",
              "গণিত-২\nSS",
              "ইংরেজি-২\nTA",
              "বাংলা-২\nNF",
              "কৃষি-২\nSA",
              "ট্রেড-৩\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু.",
              "",
              "বা ও বি-২\nRA",
              "ট্রেড-৪\nকম, ড্রে.মে, জে.ই, জে.মে, এ. ফু."
            ]
          }
        ]
      }
    ],
    "teachers": {
      "SI": "মোঃ সাদিকুল ইসলাম",
      "SS": "মোঃ সাইফুল ইসলাম সাঈদ",
      "RA": "মোঃ রবিউল আলম",
      "EH": "ইমদাদুল হক",
      "JH": "জামিল হোসেন",
      "SA": "শাফিউল আলম",
      "DR": "দ্বিপ্তী রাণী",
      "NF": "নাহিদা ফেরদৌসী",
      "TA": "তানজিলা আক্তার",
      "SA-F": "শারমিন আক্তার",
      "CA": "চাঁপা আক্তার",
      "NA": "নেলি আক্তার",
      "NA-O": "নাজমা আক্তার",
      "RA-F": "রিপা আক্তার",
      "KK": "কামরুজ্জামান খন্দকার"
    },
    "published": true
  },
  "college": {
    "branch": "কলেজ",
    "academicYear": "২০২৬",
    "effectiveDate": "২০২৬-০১-০১",
    "periods": [
      "সমাবেশ ১০-১০:৩০",
      "১ম ঘন্টা ১০:৩০-১১:১৫",
      "২য় ঘন্টা  ১১:১৫-১২:০০",
      "৩য় ঘন্টা  ১২:০০-১২:৪৫",
      "৪র্থ ঘন্টা  ১২:৪৫-১:৩০",
      "বিরতি ১:৩০-২:০০",
      "৫ম ঘন্টা  ২:০০-২:৪৫",
      "৬ষ্ঠ ঘন্টা ২:৪৫-৩:৩০"
    ],
    "days": [
      {
        "name": "রবি",
        "classes": [
          {
            "name": "১১শ",
            "lessons": [
              "সমাবেশ",
              "ব্যবঃ সংঃ ১\nSI",
              "বাংলা-১\nAK",
              "গণিত\nSM",
              "হিঃ বিঃ ১\nNA",
              "বিরতি ৩০ মিনিট",
              "ইংরেজি-১\nSAK",
              "কম্পিউটার\nMR"
            ]
          },
          {
            "name": "১২শ",
            "lessons": [
              "",
              "হিঃ বিঃ ২\nNA",
              "ইংরেজি-২\nSAK",
              "কম্পিউটার-২\nMR",
              "ব্যবঃ সংঃ ২\nSI",
              "",
              "বাংলা-২\nAK",
              "কঃ একাঃ\nNA"
            ]
          }
        ]
      },
      {
        "name": "সোম",
        "classes": [
          {
            "name": "১১শ",
            "lessons": [
              "",
              "ব্যবঃ সংঃ ১\nSI",
              "অর্থনীতি\nSM",
              "কম্পিউটার-১\nMR",
              "হিঃ বিঃ ১\nNA",
              "",
              "মার্কেটিং-১\nSI",
              "কঃ একাঃ সি-১\nNA"
            ]
          },
          {
            "name": "১২শ",
            "lessons": [
              "",
              "হিঃ বিঃ ২\nNA",
              "মার্কেটিং\nSI",
              "বিজনেস ইংলিশ\nSM",
              "কম্পিউটার-২\nMR",
              "",
              "কঃ একাঃ সি\nNA",
              "ডিজিটাল টেকঃ\nMR"
            ]
          }
        ]
      },
      {
        "name": "মঙ্গল",
        "classes": [
          {
            "name": "১১শ",
            "lessons": [
              "",
              "বাংলা-১\nAK",
              "অর্থনীতি\nSM",
              "ইংরেজি-১\nSAK",
              "মার্কেটিং-১\nSI",
              "",
              "গণিত\nSM",
              "ব্যবহারিক"
            ]
          },
          {
            "name": "১২শ",
            "lessons": [
              "",
              "ইংরেজি-২\nSAK",
              "মার্কেটিং-২\nSI",
              "বাংলা-২\nAK",
              "অফিঃ ম্যানেঃ\nRIB",
              "",
              "ব্যবঃ সংঃ\nSI",
              "ব্যবহারিক"
            ]
          }
        ]
      },
      {
        "name": "বুধ",
        "classes": [
          {
            "name": "১১শ",
            "lessons": [
              "",
              "হিঃ বিঃ ১\nNA",
              "গণিত\nSM",
              "কম্পিউটার\nMR",
              "অর্থনীতি\nSM",
              "",
              "কঃ একাঃ সি\nNA",
              "ব্যবহারিক"
            ]
          },
          {
            "name": "১২শ",
            "lessons": [
              "",
              "কম্পিউটার\nMR",
              "ব্যবঃ সংঃ\nSI",
              "হিঃ বিঃ\nNA",
              "অফিঃ ম্যানেঃ\nRIB",
              "",
              "ডিজিটাল টেকঃ\nMR",
              "ব্যবহারিক"
            ]
          }
        ]
      },
      {
        "name": "বৃহষ্পতি",
        "classes": [
          {
            "name": "১১শ",
            "lessons": [
              "",
              "বাংলা-১\nAK",
              "হিঃ বিঃ\nNA",
              "ইংরেজি-১\nSAK",
              "পরিসংখ্যান\nSM",
              "",
              "কঃ একাঃ সি\nNA",
              "কম্পিউটার\nMR"
            ]
          },
          {
            "name": "১২শ",
            "lessons": [
              "",
              "ইংরেজি-২\nSAK",
              "কম্পিউটার-২\nMR",
              "বাংলা-২\nAK",
              "হিঃ বিঃ ২\nNA",
              "",
              "ডিজিটাল টেকঃ\nMR",
              "বিজনেস ইংলিশ\nSM"
            ]
          }
        ]
      }
    ],
    "teachers": {
      "RIB": "মোঃ রফিকুল ইসলাম বায়েজীদ",
      "MR": "মোঃ মাসুদ রানা",
      "SAK": "শফিউল আলীম খোকন",
      "NA": "নাজমা আক্তার",
      "AK": "আলমগীর কবীর",
      "SI": "সাইফুল ইসলাম",
      "SM": "শামীম মিয়া"
    },
    "published": true
  }
};

export const routineTeacherPhotos = {
  school: {
    "SI": "images/teachers/teacher-15.jpg",
    "SS": "images/teachers/teacher-17.jpg",
    "RA": "images/teachers/teacher-13.jpg",
    "EH": "images/teachers/teacher-08.jpg",
    "JH": "images/teachers/teacher-09.jpg",
    "SA": "images/teachers/teacher-12.jpg",
    "DR": "images/teachers/teacher-10.jpg",
    "NF": "images/teachers/teacher-14.jpg",
    "TA": "images/teachers/teacher-16.jpg",
    "SA-F": "images/staffs/staff-02.jpg",
    "CA": "images/staffs/staff-04.jpg",
    "NA": "images/staffs/staff-09.jpg",
    "NA-O": "images/staffs/staff-08.jpg",
    "KK": "images/teachers/teacher-11.jpg"
  },
  college: {
    "RIB": "images/teachers/teacher-01.jpg",
    "MR": "images/teachers/teacher-06.jpg",
    "NA": "images/teachers/teacher-04.jpg",
    "AK": "images/teachers/teacher-02.jpg",
    "SI": "images/teachers/teacher-15.jpg",
    "SM": "images/teachers/teacher-07.jpg"
  }
};
